Tekla.Structures.TeklaStructuresInternal.GenericDelegateFake`1
Implements ICDelegate so that every method returns according to Tekla.Structures.RemotingHelper.IReturnStrategy
Can be used in unit testing to mock Tekla Structures behavior, by setting
a ICDelegate instance using Tekla.Structures.TeklaStructuresInternal.CDelegateSetter.

Tekla.Structures.TeklaStructuresInternal.GenericDelegateFake`1.ExportGetAttributeFile(Tekla.Structures.TeklaStructuresInternal.dotGetAttributeFile_t@)
DO NOT USE! For internal usage only!
data: The data.
Returns: True if file was found.